Revit 2024 API
BuiltInFailures.BendFailures.NotBentControl Property
 While making curved beam type "[Type Name]" some Control elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentControl { get; }
Visual Basic
Public Shared ReadOnly Property NotBentControl As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentControl {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace